In [1]:
import numpy as np
import pandas as pd

In [2]:
data={'name':['Jack','Tom','Mary'],
      'age':[18,19,20],
      'gender':['m','m','wi']}

In [3]:
data

{'age': [18, 19, 20],
 'gender': ['m', 'm', 'wi'],
 'name': ['Jack', 'Tom', 'Mary']}

In [4]:
df=pd.DataFrame(data)

In [5]:
df

   age gender  name
0   18      m  Jack
1   19      m   Tom
2   20     wi  Mary

In [6]:
df.head(2)

   age gender  name
0   18      m  Jack
1   19      m   Tom

In [7]:
df.tail(2)

   age gender  name
1   19      m   Tom
2   20     wi  Mary

In [8]:
df.T

           0    1     2
age       18   19    20
gender     m    m    wi
name    Jack  Tom  Mary

In [9]:
df

   age gender  name
0   18      m  Jack
1   19      m   Tom
2   20     wi  Mary

In [10]:
df['a']=100

In [11]:
df

   age gender  name    a
0   18      m  Jack  100
1   19      m   Tom  100
2   20     wi  Mary  100

In [12]:
df.T

           0    1     2
age       18   19    20
gender     m    m    wi
name    Jack  Tom  Mary
a        100  100   100

In [13]:
df

   age gender  name    a
0   18      m  Jack  100
1   19      m   Tom  100
2   20     wi  Mary  100

In [14]:
df['age'].iloc[0]=20

/usr/local/lib/python3.5/dist-packages/pandas/core/indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [15]:
df

   age gender  name    a
0   20      m  Jack  100
1   19      m   Tom  100
2   20     wi  Mary  100

In [19]:
del df['a']

In [20]:
df

   age gender  name
0   20      m  Jack
1   19      m   Tom
2   20     wi  Mary

In [23]:
dropDf=df.drop(0)

In [24]:
df

   age gender  name
0   20      m  Jack
1   19      m   Tom
2   20     wi  Mary

In [25]:
dropDf

   age gender  name
1   19      m   Tom
2   20     wi  Mary

## sort

In [28]:
sortDf=df.sort_values(['age'],ascending=True)

In [29]:
sortDf

   age gender  name
1   19      m   Tom
0   20      m  Jack
2   20     wi  Mary

In [30]:
df.sort_index()

   age gender  name
0   20      m  Jack
1   19      m   Tom
2   20     wi  Mary